{"backend": "tensorflow", "config": [{"config": {"merge_mode": "concat", "layer": {"config": {"recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": false, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "implementation": 0, "dropout": 0.0, "bias_constraint": null, "units": 7, "activation": "tanh", "stateful": false, "recurrent_regularizer": null, "return_sequences": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_constraint": null, "use_bias": true, "go_backwards": false, "name": "lstm_14", "kernel_constraint": null}, "class_name": "LSTM"}, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 7, 3], "name": "bidirectional_14"}, "class_name": "Bidirectional"}, {"config": {"bias_constraint": null, "units": 7, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_27", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_14", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "units": 1, "kernel_regularizer": null, "activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_28", "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.8"}